package ua.univer.base.homework;

import java.util.Scanner;

public class HomeWorkTasksCase {
    public static void main(String[] args) {

        System.out.println("Выберите № задачи ");
        System.out.println("1- Задача 1 и 2");
        System.out.println("2- Задача 3");
        System.out.println("3- Задача 4");
        System.out.println("4- Задача 5");
        Scanner sc0 = new Scanner(System.in);
        System.out.println("Введите № задачи ");
        int n = sc0.nextInt();
        switch (n) {
            case 1:
        Scanner sc = new Scanner(System.in);
        System.out.println("Введите месяц ");
        int month = sc.nextInt();
        int day = TasksCaseLib.Task04DayInMonth(month);
        System.out.println("Кол-ко дней в этом месяце = " +day);

        System.out.println("--------------------------------------------------------------");
        System.out.println("Даны два целых числа: D (день) и M (месяц), определяющие правильную дату невисокосного года.\n" +
                "            Вывести значения D и M для даты, следующей за указанной.");
        System.out.println("----------------------------------------------------------------");
        System.out.println("Введите день ");
        int day1=sc.nextInt();
        TasksCaseLib.Task09NextDay(day1, month);
        break;

            case 2:

        System.out.println("----------------------------------------------------------------");
        System.out.println("Дано целое число в диапазоне 100–999. Вывести строку-описание\n" +
                "            данного числа, например: 256 — «двести пятьдесят шесть», 814 — «восемьсот четырнадцать». ");
        System.out.println("----------------------------------------------------------------");
        TasksCaseLib.Task18DescriptionString();
        break;

            case 3:

        System.out.println("----------------------------------------------------------------");
        System.out.println(" В восточном календаре принят 60-летний цикл, состоящий из 12-летних подциклов, обозначаемых\n" +
                "            названиями цвета: зеленый, красный, желтый, белый и черный. В каждом подцикле годы носят названия животных:\n" +
                "            крысы, коровы, тигра, зайца, дракона, змеи, лошади, овцы, обезьяны, курицы, собаки и свиньи.\n" +
                "            По номеру года определить его название, если 1984 год — начало цикла: «год зеленой крысы».");
        System.out.println("----------------------------------------------------------------");


        TasksCaseLib.Task19OrientalCalendar();
        break;
            case 4:
        System.out.println("----------------------------------------------------------------");
        System.out.println(" Даны два целых числа: D (день) и M (месяц), определяющие правильную дату.\n" +
                "     Вывести знак Зодиака, соответствующий этой дате: «Водолей» (20.1–18.2), «Рыбы» (19.2–20.3), «Овен» (21.3–19.4),\n" +
                "     «Телец» (20.4–20.5), «Близнецы» (21.5–21.6), «Рак» (22.6–22.7), «Лев» (23.7–22.8), «Дева» (23.8–22.9),\n" +
                "     «Весы» (23.9–22.10), «Скорпион» (23.10–22.11), «Стрелец» (23.11–21.12), «Козерог» (22.12–19.1).");
        System.out.println("----------------------------------------------------------------");
        TasksCaseLib.Task20ZodiacSigns();
        break;}


    }



}
