package ua.univer.base.homework.begin;
/*
Найти корни квадратного уравнения A·x2 + B·x + C = 0, заданного
своими коэффициентами A, B, C (коэффициент A не равен 0), если известно, что дискриминант уравнения положителен.
Вывести вначале меньший, а затем больший из найденных корней.
Корни квадратного уравнения находятся по формуле x1,2 = ( )/ − ± B D (2·A), где D — дискриминант, равный B2 – 4·A·C.

 */
public class Task05 {
    public static void main(String[] args) {
        int a,b,c;


    }
}
